# How to Run SQL Queries On Your Pandas DataFrames With Python
                        
Pandas is being increasingly used by Data Scientists and Data Analysts for data analysis purposes, and it has the advantage of being part of the wider Python universe, making it accessible to many people. SQL on the other hand is known for its performance, being human-readable, and can be easily understood even by non-technical people.                
                                                                  
What if we could find a way to combine the benefits of both Pandas and SQL statements? Here is where pandasql comes in handy.
                    
### Pandasql
It is basically used to query pandas DataFrames using SQL syntax. The same process can be performed using sqldf to interact with R DataFrames.

#### Prerequisites
The installation is straightforward with the syntaxes below depending on your environment:

In [8]:
%pip install pandasql

Requirement already satisfied: pandasql in c:\users\administrator\anaconda3\lib\site-packages (0.7.3)
Requirement already satisfied: sqlalchemy in c:\users\administrator\anaconda3\lib\site-packages (from pandasql) (1.4.39)
Requirement already satisfied: pandas in c:\users\administrator\anaconda3\lib\site-packages (from pandasql) (1.3.4)
Requirement already satisfied: numpy in c:\users\administrator\anaconda3\lib\site-packages (from pandasql) (1.23.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\administrator\anaconda3\lib\site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in c:\users\administrator\anaconda3\lib\site-packages (from pandas->pandasql) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\administrator\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas->pandasql) (1.16.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\administrator\anaconda3\lib\site-packages (from sqlalchemy->pandasql) (1.1.1)
Note: you may need to restart the kernel to use updated packages.

### After successfully installing the library, you should be able to import the library using the following statement.

In [1]:
from pandasql import sqldf

 ### let’s start by creating the datasets StudentTable and TeachingAssistantTablethat will be used for hands-on practice.

In [2]:
# Import the pandas library for creating the dataframes
import pandas as pd

In [3]:
# Create the Student Data Frame

students= {
    'Students':["Sira","Ibrahim","Moussa","Mamadou","Nabintou"],
    'Gender':['Female','Male','Male', "Male", "Female"],
    'Age':[18, 27, 19, 22, 21],
    'Email': ["sira@info.com", "ib@info.com", "mouss@info.com", 
             "mam@info.com", "nab@info.com"]
          }
students_df = pd.DataFrame(students)

students_df

   Students  Gender  Age           Email
0      Sira  Female   18   sira@info.com
1   Ibrahim    Male   27     ib@info.com
2    Moussa    Male   19  mouss@info.com
3   Mamadou    Male   22    mam@info.com
4  Nabintou  Female   21    nab@info.com

In [4]:
# Create the Teaching Assistant Data Frame

teaching_assistant= {
    'Teacher':["Ibrahim","Nabintou","Mamadou","Fatim","Aziz"],
    'Email':['ib@info.com','nab@info.com','mam@info.com', 
             "fat@info.com", "aziz@info.com"],
    'Degree':["M.S in Data Science", "B.S in Statistics", 
              "B. Comp Sc", "M.S. Architecture", "B.S in Accounting"],
    'Department': ["Business", "Statistics", "Comp Sc", 
             "Engineering", "Business"]
          }
teaching_assistant_df = pd.DataFrame(teaching_assistant)

teaching_assistant_df

    Teacher          Email               Degree   Department
0   Ibrahim    ib@info.com  M.S in Data Science     Business
1  Nabintou   nab@info.com    B.S in Statistics   Statistics
2   Mamadou   mam@info.com           B. Comp Sc      Comp Sc
3     Fatim   fat@info.com    M.S. Architecture  Engineering
4      Aziz  aziz@info.com    B.S in Accounting     Business

### These are the main concepts that will be covered in this section:
##### (1) column section
##### (2) data filtering
##### (3) data aggregation 
##### (4) data joining

# Column Selection

#### This corresponds to selecting part or all the columns of your database/data frame. It is performed with the keyword       
   ##### SELECT col_1, col_2,... col_X FROM tableName

##### → 1, 2, ...X correspond to the columns you are interested in having in the final result.

##### → tableName is the name of the dataframe/table.

The result from the following code includes all the columns of the student dataframe.

In [7]:
all_students = sqldf("SELECT * FROM students_df")
print(all_students)

   Students  Gender  Age           Email
0      Sira  Female   18   sira@info.com
1   Ibrahim    Male   27     ib@info.com
2    Moussa    Male   19  mouss@info.com
3   Mamadou    Male   22    mam@info.com
4  Nabintou  Female   21    nab@info.com

In [8]:
all_students = sqldf("SELECT Students, Gender FROM students_df")
print(all_students)

   Students  Gender
0      Sira  Female
1   Ibrahim    Male
2    Moussa    Male
3   Mamadou    Male
4  Nabintou  Female

#### all_students is also a DataFrame, which can be helpful if you want to perform quick Pandas tasks such as column types. Below is an illustration.

In [9]:
# Check the type of all_students
print(type(all_students))

# Run Pandas Statement to show the type of the columns
print("---"*10)
print(all_students.dtypes)

<class 'pandas.core.frame.DataFrame'>
------------------------------
Students    object
Gender      object
dtype: object

Sometimes when you have complicated queries, you can proceed step by step as follow:

Define the query as a string. When doing so, make sure to use the triple quote sign ”””so that you can write the query on multiple lines.                         
Apply the sqldf function to the query to get the result.                    
Let’s say we want the student's name, their email and limit the result to the first 3.

In [12]:
# Query definition
query = """ SELECT Students, Email 
            FROM students_df 
            LIMIT 2
        """
# Query execution
name_email = sqldf(query)
name_email

  Students          Email
0     Sira  sira@info.com
1  Ibrahim    ib@info.com

 # Data Filtering
 
 ##### Data filtering is when the WHERE statement comes into the equation to perform custom filtering on the result of the SELECT statement.

Let’s imagine that we want all the female students.

In [14]:
# Define the query
query = """SELECT * 
           FROM students_df 
           WHERE Gender = 'Male'
        """

# Execute the query
female_student = sqldf(query)
female_student

  Students Gender  Age           Email
0  Ibrahim   Male   27     ib@info.com
1   Moussa   Male   19  mouss@info.com
2  Mamadou   Male   22    mam@info.com

Let’s have a look at this query that aims to retrieve the Name, Email, and Degree of all the Teaching Assistants with a Master's Degree.

In [18]:
query = """ SELECT Teacher, Email, Degree 
            FROM teaching_assistant_df 
            WHERE Degree LIKE 'B.%'
            """
ms_students = sqldf(query)
ms_students

    Teacher          Email             Degree
0  Nabintou   nab@info.com  B.S in Statistics
1   Mamadou   mam@info.com         B. Comp Sc
2      Aziz  aziz@info.com  B.S in Accounting

I have decided to perform the same request, this time using Pandas statement, and this is what it looks like!

In [19]:
cols_to_get = ['Teacher', 'Email', 'Degree']
teaching_assistant_df[teaching_assistant_df.Degree.str.startswith('M.S')][cols_to_get]

   Teacher         Email               Degree
0  Ibrahim   ib@info.com  M.S in Data Science
3    Fatim  fat@info.com    M.S. Architecture

#### This looks like. scary statement 🥺. Let’s understand what happened:

###### cols_to_get corresponds to the columns we want in the final dataframe. It’s basically equivalent to the columns we specify when using the SELECT statement.
###### teaching_assistant_df.Degree.str.startswith('M.S') returns True is the value in the Degreecolumn starts with 'M.S'. FalseOtherwise.
###### Finally, those boolean values are transmitted to the starting teaching_assistant_df to get rows where the result is True.
#### But… we performed the same task with SQL query, and was simple and easy to understand. Without going into too much comparative analysis, just wanted to emphasize how complicated can be some queries that are simple to write in SQL.

# Data Aggregation

Aggregation in SQL is performed with the help of aggregation functions, and these are some of the most commonly used: COUNT , SUM , MAX & MIN , and AVG . For instance, you can get the age of students, based on their gender.

In [14]:
query = """ SELECT AVG(Age), Gender 
            FROM students_df 
            GROUP BY Gender
        """
avg_age = sqldf(query)
avg_age

    AVG(Age)  Gender
0  19.500000  Female
1  22.666667    Male

# Data Joining

### The join concept becomes useful when we want to combine data from at least two tables. This section goes straight to the point with only one type of join. 
                                    
#### Imagine you want to know who is both a student and also a teaching assistant. The answer to this requires joining our two tables as follows, using an INNER JOIN and the final result contains the following information:
                           
###### Student Name, Gender, Email, and Age from the students_df table.
###### Department from the teaching_assistant_df dataframe.

In [15]:
query = """ SELECT st.Students, st.Gender, st.Email, st.Age, tat.Department
            FROM students_df st INNER JOIN teaching_assistant_df tat 
            ON st.Email = tat.Email;
            """

result = sqldf(query)
result

   Students  Gender         Email  Age  Department
0   Ibrahim    Male   ib@info.com   27    Business
1   Mamadou    Male  mam@info.com   22     Comp Sc
2  Nabintou  Female  nab@info.com   21  Statistics

### Limitations of Pandasql
#### As Pandasql uses SQLite, it is subjected to all the limitations of SQLite. For example, SQLite does not implement right outer join or full outer join.
#### Pandasql performs query only, it cannot perform SQL operations such as update, insert or alter tables.